In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [
    {'name': 'John', 'age': 28, 'city': 'New York'},
    {'name': 'Anna', 'age': 24, 'city': 'Paris'},
    {'name': 'Peter', 'age': 35, 'city': 'Berlin'},
    {'name': 'Linda', 'age': 32, 'city': 'London'}
]

df = pd.DataFrame(data)

df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [3]:
df.to_csv('data.csv', index=False)

In [4]:
df = pd.read_csv('data.csv')
df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

# COLUMN INDEXING

In [5]:
df = pd.read_csv('data.csv')
df

    name  age      city
0   John   28  New York
1   Anna   24     Paris
2  Peter   35    Berlin
3  Linda   32    London

In [9]:
ages = df["age"]
ages

0    28
1    24
2    35
3    32
Name: age, dtype: int64

In [10]:
ages < 25

0    False
1     True
2    False
3    False
Name: age, dtype: bool

# ROW INDEXING

In [11]:
df.loc[3]

name     Linda
age         32
city    London
Name: 3, dtype: object

In [12]:
df.set_index("name", inplace=True)
df

       age      city
name
John    28  New York
Anna    24     Paris
Peter   35    Berlin
Linda   32    London

In [13]:
df.loc["Peter"]

age         35
city    Berlin
Name: Peter, dtype: object

In [21]:
df.iloc[0,0]

28

In [19]:
mask = df["age"]>25
mask

name
John      True
Anna     False
Peter     True
Linda     True
Name: age, dtype: bool

In [20]:
df[mask]

       age      city
name
John    28  New York
Peter   35    Berlin
Linda   32    London